<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest Zoom Client IT Managed package.</string>
    <key>Identifier</key>
    <string>com.csulb.autopkg.download.Zoom</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Zoom</string>
        <key>DOWNLOAD_URL</key>
        <string>https://zoom.us/client/latest/ZoomInstallerIT.pkg</string>
    </dict>
        <key>MinimumVersion</key>
        <string>1.4.1</string>
        <key>Process</key>
        <array>
    <dict>
        <key>Processor</key>
        <string>URLDownloader</string>
        <key>Arguments</key>
        <dict>
            <key>url</key>
            <string>%DOWNLOAD_URL%</string>
            <key>filename</key>
            <string>ZoomInstallerIT.pkg</string>
        </dict>
    </dict>
    <dict>
        <key>Processor</key>
        <string>EndOfCheckPhase</string>
    </dict>
    <dict>
        <key>Arguments</key>
        <dict>
            <key>expected_authority_names</key>
            <array>
                <string>Developer ID Installer: Zoom Video Communications, Inc. (BJ4HAAB9B3)</string>
                <string>Developer ID Certification Authority</string>
                <string>Apple Root CA</string>
            </array>
            <key>input_path</key>
            <string>%pathname%</string>
        </dict>
        <key>Processor</key>
        <string>CodeSignatureVerifier</string>
    </dict>
</array>
</dict>
</plist>
