Description: Downloads latest Zoom disk image and builds a package.
Identifier: com.csulb.Jamf.Camtasia23.download
Input:
  API_PASSWORD: '%JAMF_SANDBOX_API_PASSWORD%'
  API_USERNAME: '%JAMF_SANDBOX_API_USERNAME%'
  CATEGORY: Patch
  GROUP_NAME: '%NAME%-update-smart'
  GROUP_TEMPLATE: JamfSmartGroupTemplate-NeedsUpdateInstall-Test.xml
  JSS_URL: '%JAMF_SANDBOX_URL%'
  NAME: TechSmith Camtasia 2023
  PATCH_ENABLED: 'true'
  PATCH_NAME: '%NAME% - %version%'
  PATCH_SOFTWARE_TITLE: '%NAME%'
  PATCH_TEMPLATE: JamfPatchTemplate-SS-Test.xml
  POLICY_CATEGORY: Patch
  POLICY_NAME: '%NAME% - %version%'
  POLICY_TEMPLATE: JamfPolicyTemplate-Install-wSS-Test.xml
  SELF_SERVICE_DESCRIPTION: Camtasia is a recording application
  SELF_SERVICE_DISPLAY_NAME: '%NAME% - %version%'
  SSELF_SERVICE_ICON: '%NAME%.png'
  TESTING_GROUP_NAME: Testing
  UPDATE_PREDICATE: pkg_uploaded == False
MinimumVersion: 0.4.0
ParentRecipe: com.csulb.download.Camtasia
ParentRecipeTrustInfo:
  non_core_processors: {}
  parent_recipes:
    com.csulb.download.Camtasia:
      git_hash: fbec61677ff509d60257eb0b91998afb6dbd4884
      path: ~/Library/AutoPkg/RecipeRepos/com.github.nirvanaboi10.TestingAutopkg/Camtasia23.download.recipe
      sha256_hash: 5dca41e959d7d31ca1de691b201dbc45adeaaa10710d4cb4e7cd472cbb53bcf3
Process:
- Arguments:
    computergroup_name: '%GROUP_NAME%'
    computergroup_template: '%GROUP_TEMPLATE%'
    replace_group: 'true'
  Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
- Arguments:
    API_PASSWORD: '%API_PASSWORD%'
    API_USERNAME: '%API_USERNAME%'
    JSS_URL: '%JSS_URL%'
  Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
- Arguments:
    predicate: '%UPDATE_PREDICATE%'
  Processor: StopProcessingIf
- Arguments:
    icon: '%SELF_SERVICE_ICON%'
    policy_name: '%POLICY_NAME%'
    policy_template: '%POLICY_TEMPLATE%'
    replace_policy: 'true'
  Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
- Arguments:
    API_PASSWORD: '%API_PASSWORD%'
    API_USERNAME: '%API_USERNAME%'
    JSS_URL: '%JSS_URL%'
    patch_icon_policy_name: '%POLICY_NAME%'
    patch_name: '%PATCH_NAME%'
    patch_softwaretitle: '%PATCH_SOFTWARE_TITLE%'
    patch_template: '%PATCH_TEMPLATE%'
    replace_patch: 'true'
  Processor: com.github.grahampugh.jamf-upload.processors/JamfPatchUploader
- Arguments:
    slack_webhook_url: '%SLACK_WEBHOOK_URL%'
  Processor: com.github.grahampugh.jamf-upload.processors/JamfUploaderSlacker
